app/controllers/cat_rental_requests_controller.rb

  def create
    @request = CatRentalRequest.new(rental_params)

    if @request.save
      redirect_to cat_url(@request.cat)
    else
      flash.now[:errors] = @request.errors.full_messages
      @cats = Cat.all
---
INSERT INTO "cat_rental_requests" ("cat_id", "created_at", "end_date", "start_date", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 2], ["created_at", "2014-10-30 00:18:30.281499"], ["end_date", "2014-10-30"], ["start_date", "2014-10-29"], ["updated_at", "2014-10-30 00:18:30.281499"], ["user_id", 1]]
SELECT "cats".* FROM "cats"

  def approve
    @request = CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 18]]
SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 18]]

  def deny
    @request = CatRentalRequest.includes(:cat).find(params[:id])
---
SELECT  "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 6]]
SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 18]]

  def new
    @cats = Cat.all
---
SELECT  "cats".* FROM "cats"   ORDER BY "cats"."id" ASC LIMIT 1