app/controllers/cats_controller.rb

  def create

    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "created_at", "description", "name", "sex", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update

    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats"  WHERE "cats"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "cats" SET "description" = $1, "name" = $2, "updated_at" = $3 WHERE "cats"."id" = 2  [["description", "             "], ["name", "Joe"], ["updated_at", "2014-10-28 21:09:20.915844"]]